Tekla.Structures.Drawing.Circle
The Circle class defines the graphical object circle. A circle can also be hatched.
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
if(MyDrawingHandler.GetConnectionStatus())
{
Circle MyCircle;
DrawingObjectEnumerator views = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
while(views.MoveNext())
{
MyCircle = new Circle(views.Current as ViewBase, new Point(10, 10), 300);
MyCircle.Insert();
}
}
}
}

Tekla.Structures.Drawing.Circle.CenterPoint
The center point of the circle.

Tekla.Structures.Drawing.Circle.Radius
The radius of the circle.

Tekla.Structures.Drawing.Circle.Attributes
The attributes of the circle.

Tekla.Structures.Drawing.Circle.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.Circle.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.Double,Tekla.Structures.Drawing.Circle.CircleAttributes)
Creates a new circle instance with a center point and a radius using the given attributes.
view: The view to be used.
centerPoint: The center point to be used.
radius: The radius to be used.
attributes: The circle attributes to be used.

Tekla.Structures.Drawing.Circle.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.Double)
Creates a new circle instance with a center point and a radius using standard attributes.
view: The view to be used.
centerPoint: The center point to be used.
radius: The radius to be used.

Tekla.Structures.Drawing.Circle.Delete
Calls the system to delete the object.
Returns: True on success.

Tekla.Structures.Drawing.Circle.Modify
Calls the system to update/modify the object.
Returns: True on success.

Tekla.Structures.Drawing.Circle.Insert
Calls the system to insert the new object.
Returns: True on success.

Tekla.Structures.Drawing.Circle.Select
Calls the system to select and retrieve the object.
Returns: True on success.